[metadata]
creation_date = "2026/06/22"
updated_date = "2026/06/22"
maturity = "production"

[rule]
author = ["Joao Machado"]
rule_id = "c2b6e4a8-1d39-4f72-9a05-3e8b6c1d4f27"
name = "AWS Console Login Without MFA"
description = """
Detects a successful interactive AWS console login where multi-factor
authentication was not used. Credential-only console access is a common
foothold for an attacker who has stolen a password but lacks a second
factor.
"""
severity = "high"
risk_score = 68
type = "query"
language = "kuery"
index = ["logs-aws.cloudtrail-*", "filebeat-*"]
query = '''
event.action : "ConsoleLogin" and aws.cloudtrail.response_elements.console_login : "Success" and not aws.cloudtrail.additional_event_data.mfa_used : "Yes"
'''
references = ["https://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa.html"]
false_positives = ["Accounts that are intentionally exempt from MFA enrollment, if any"]

[[rule.threat]]
framework = "MITRE ATT&CK"
[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"
[[rule.threat.technique]]
id = "T1078"
name = "Valid Accounts"
reference = "https://attack.mitre.org/techniques/T1078/"
[[rule.threat.technique.subtechnique]]
id = "T1078.004"
name = "Cloud Accounts"
reference = "https://attack.mitre.org/techniques/T1078/004/"
